<!DOCTYPE HTML>

<html lang="ja">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1.0, user-scalable=no" />
<meta name="format-detection" content="telephone=no"/>
<link rel="stylesheet" href="./css/base.css" type="text/css">
<title>Dungeons and Towers</title>
<script>
  (adsbygoogle = window.adsbygoogle || []).push({
    google_ad_client: "ca-pub-5645089288102207",
    enable_page_level_ads: true
  });
</script>

</head>

<body>
<h1 style="font-size: 1.1em;">Democratic Dungeon Light</h1>
多数決による地下迷宮。闘って育てるだけ、の簡易版です。
<hr>
簡単な説明<br>
<br>
<pre>
まずは、アクセスをしていただいてありがとうございます。
このゲームは非常にシンプルで、大まか「RPGから、戦闘と成長と買い物だけを切り出した」ものになります。
なので
・戦闘して
・経験値つかって育てたり、お金つかって買い物したり
するゲームです。

ステータスについて
筋力、敏捷、幸運は重要です。９未満だとちょっと残念なので、１２以上にしておくとよいです。
耐久はいわゆるHPだと思ってください。
知性と魔力は、当面は不要です。バージョンアップで意味がでる予定です。

攻撃力
このゲームではさいころ(いわゆる六面ダイス)を使ったような判定になります。
5Dと書いてある場合「さいころ５つ分の攻撃力」になります。5～30の値になるわけですね。
当然ですが「数字が大きいほうが有利」です。

戦闘画面での数字の羅列
あれこそが「さいころ」を振った結果です！！
ちなみに６が出ると「貫通ダメージ」という「鎧を着ようが強かろうがとにかく問答無用で入るダメージ」です。

防御力
あなた方は戦士なので、かいてある防御力の「２倍」のダメージを、防具によって吸収させることが出来ます。
「防具がなければ木っ端微塵になりそうな」ダメージでも、食い止められる、かも、しれません！！
もちろん「防具で食い止めてなお木っ端微塵になるダメージ」を出すモンスターもいるわけなのですが。

敵について
敵は、MR(モンスターレート)という値で強さをあらわします。
大体、MRの1/10が「敵さんの振れるさいころの数」なので。自分の攻撃力と相談しながら敵の強さを選んでください。
「おんなじさいころの数」だと、ぶっちゃけ「多分負けます」んで、少し少な目を狙いましょうｗ

経験値とお金
MRと同じ値が経験値として入ります。お金は「1～MR」の間の乱数です。
稀に、お金に関しては「フィーバー」する可能性があります。

経験点の使い方
<a href="./?c=growth">成長させる</a>で成長させることができます。
必要な経験点は書いてあるからよいですよね？

魔法と消費型アイテム
「攻撃のかわりに魔法を唱える」「攻撃のかわりにアイテムを使用する」では、ありません！！
「魔法を唱えつつ攻撃をしたり」「アイテムを使いつつ攻撃をする」のです！！
使えるところでは惜しげもなく使っていきましょう！
</pre>

<hr>
お問い合わせなどありましたら、現状、すみません twitter で <a href="http://twitter.com/gallu/">@gallu</a> 宛にお声がけいただければ、気づき次第返信出来るよう努力いたします。<br>
寂しんぼなので、激励とか要望とか大歓迎です。<br>
<br>
<a href="./">もどる　</a>
</body>
</html>
